Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEbcu_regdef.h
/**
 * \file IfxEbcu_regdef.h
 * \brief
 * \copyright Copyright (c) 2015 Infineon Technologies AG. All rights reserved.
 *
 *
 * Date: 2015-12-17 16:05:48 GMT
 * Version: TBD
 * Specification: TBD
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxLld_Ebcu_Registers EbcuRegisters
 * \ingroup IfxLld
 * 
 * \defgroup IfxLld_Ebcu_Registers_Bitfields Bitfields
 * \ingroup IfxLld_Ebcu_Registers
 * 
 * \defgroup IfxLld_Ebcu_Registers_union Register unions
 * \ingroup IfxLld_Ebcu_Registers
 * 
 * \defgroup IfxLld_Ebcu_Registers_struct Memory map
 * \ingroup IfxLld_Ebcu_Registers
 */
#ifndef IFXEBCU_REGDEF_H
#define IFXEBCU_REGDEF_H 1
/******************************************************************************/
#include "Ifx_TypesReg.h"
/******************************************************************************/
/** \addtogroup IfxLld_Ebcu_Bitfields
 * \{  */
/** \brief Access Enable Register 0 */
typedef struct _Ifx_EBCU_ACCEN0_Bits
{
    Ifx_UReg_32Bit EN0:1;             /**< \brief [0:0] Access Enable for Master TAG ID ${n} - EN${n} (rw) */
    Ifx_UReg_32Bit EN1:1;             /**< \brief [1:1] Access Enable for Master TAG ID ${n} - EN${n} (rw) */
    Ifx_UReg_32Bit EN2:1;             /**< \brief [2:2] Access Enable for Master TAG ID ${n} - EN${n} (rw) */
    Ifx_UReg_32Bit EN3:1;             /**< \brief [3:3] Access Enable for Master TAG ID ${n} - EN${n} (rw) */
    Ifx_UReg_32Bit EN4:1;             /**< \brief [4:4] Access Enable for Master TAG ID ${n} - EN${n} (rw) */
    Ifx_UReg_32Bit EN5:1;             /**< \brief [5:5] Access Enable for Master TAG ID ${n} - EN${n} (rw) */
    Ifx_UReg_32Bit EN6:1;             /**< \brief [6:6] Access Enable for Master TAG ID ${n} - EN${n} (rw) */
    Ifx_UReg_32Bit EN7:1;             /**< \brief [7:7] Access Enable for Master TAG ID ${n} - EN${n} (rw) */
    Ifx_UReg_32Bit EN8:1;             /**< \brief [8:8] Access Enable for Master TAG ID ${n} - EN${n} (rw) */
    Ifx_UReg_32Bit EN9:1;             /**< \brief [9:9] Access Enable for Master TAG ID ${n} - EN${n} (rw) */
    Ifx_UReg_32Bit EN10:1;            /**< \brief [10:10] Access Enable for Master TAG ID ${n} - EN${n} (rw) */
    Ifx_UReg_32Bit EN11:1;            /**< \brief [11:11] Access Enable for Master TAG ID ${n} - EN${n} (rw) */
    Ifx_UReg_32Bit EN12:1;            /**< \brief [12:12] Access Enable for Master TAG ID ${n} - EN${n} (rw) */
    Ifx_UReg_32Bit EN13:1;            /**< \brief [13:13] Access Enable for Master TAG ID ${n} - EN${n} (rw) */
    Ifx_UReg_32Bit EN14:1;            /**< \brief [14:14] Access Enable for Master TAG ID ${n} - EN${n} (rw) */
    Ifx_UReg_32Bit EN15:1;            /**< \brief [15:15] Access Enable for Master TAG ID ${n} - EN${n} (rw) */
    Ifx_UReg_32Bit EN16:1;            /**< \brief [16:16] Access Enable for Master TAG ID ${n} - EN${n} (rw) */
    Ifx_UReg_32Bit EN17:1;            /**< \brief [17:17] Access Enable for Master TAG ID ${n} - EN${n} (rw) */
    Ifx_UReg_32Bit EN18:1;            /**< \brief [18:18] Access Enable for Master TAG ID ${n} - EN${n} (rw) */
    Ifx_UReg_32Bit EN19:1;            /**< \brief [19:19] Access Enable for Master TAG ID ${n} - EN${n} (rw) */
    Ifx_UReg_32Bit EN20:1;            /**< \brief [20:20] Access Enable for Master TAG ID ${n} - EN${n} (rw) */
    Ifx_UReg_32Bit EN21:1;            /**< \brief [21:21] Access Enable for Master TAG ID ${n} - EN${n} (rw) */
    Ifx_UReg_32Bit EN22:1;            /**< \brief [22:22] Access Enable for Master TAG ID ${n} - EN${n} (rw) */
    Ifx_UReg_32Bit EN23:1;            /**< \brief [23:23] Access Enable for Master TAG ID ${n} - EN${n} (rw) */
    Ifx_UReg_32Bit EN24:1;            /**< \brief [24:24] Access Enable for Master TAG ID ${n} - EN${n} (rw) */
    Ifx_UReg_32Bit EN25:1;            /**< \brief [25:25] Access Enable for Master TAG ID ${n} - EN${n} (rw) */
    Ifx_UReg_32Bit EN26:1;            /**< \brief [26:26] Access Enable for Master TAG ID ${n} - EN${n} (rw) */
    Ifx_UReg_32Bit EN27:1;            /**< \brief [27:27] Access Enable for Master TAG ID ${n} - EN${n} (rw) */
    Ifx_UReg_32Bit EN28:1;            /**< \brief [28:28] Access Enable for Master TAG ID ${n} - EN${n} (rw) */
    Ifx_UReg_32Bit EN29:1;            /**< \brief [29:29] Access Enable for Master TAG ID ${n} - EN${n} (rw) */
    Ifx_UReg_32Bit EN30:1;            /**< \brief [30:30] Access Enable for Master TAG ID ${n} - EN${n} (rw) */
    Ifx_UReg_32Bit EN31:1;            /**< \brief [31:31] Access Enable for Master TAG ID ${n} - EN${n} (rw) */
} Ifx_EBCU_ACCEN0_Bits;

/** \brief Access Enable Register 1 */
typedef struct _Ifx_EBCU_ACCEN1_Bits
{
    Ifx_UReg_32Bit reserved_0:32;     /**< \brief [31:0] \internal Reserved */
} Ifx_EBCU_ACCEN1_Bits;

/** \brief EBCU EDC Alarm Clear Register ${x} */
typedef struct _Ifx_EBCU_ALCLR_Bits
{
    Ifx_UReg_32Bit CLR0:1;            /**< \brief [0:0] Alarm ${y} - CLR${y} (w) */
    Ifx_UReg_32Bit CLR1:1;            /**< \brief [1:1] Alarm ${y} - CLR${y} (w) */
    Ifx_UReg_32Bit CLR2:1;            /**< \brief [2:2] Alarm ${y} - CLR${y} (w) */
    Ifx_UReg_32Bit CLR3:1;            /**< \brief [3:3] Alarm ${y} - CLR${y} (w) */
    Ifx_UReg_32Bit CLR4:1;            /**< \brief [4:4] Alarm ${y} - CLR${y} (w) */
    Ifx_UReg_32Bit CLR5:1;            /**< \brief [5:5] Alarm ${y} - CLR${y} (w) */
    Ifx_UReg_32Bit CLR6:1;            /**< \brief [6:6] Alarm ${y} - CLR${y} (w) */
    Ifx_UReg_32Bit CLR7:1;            /**< \brief [7:7] Alarm ${y} - CLR${y} (w) */
    Ifx_UReg_32Bit CLR8:1;            /**< \brief [8:8] Alarm ${y} - CLR${y} (w) */
    Ifx_UReg_32Bit CLR9:1;            /**< \brief [9:9] Alarm ${y} - CLR${y} (w) */
    Ifx_UReg_32Bit CLR10:1;           /**< \brief [10:10] Alarm ${y} - CLR${y} (w) */
    Ifx_UReg_32Bit CLR11:1;           /**< \brief [11:11] Alarm ${y} - CLR${y} (w) */
    Ifx_UReg_32Bit CLR12:1;           /**< \brief [12:12] Alarm ${y} - CLR${y} (w) */
    Ifx_UReg_32Bit CLR13:1;           /**< \brief [13:13] Alarm ${y} - CLR${y} (w) */
    Ifx_UReg_32Bit CLR14:1;           /**< \brief [14:14] Alarm ${y} - CLR${y} (w) */
    Ifx_UReg_32Bit CLR15:1;           /**< \brief [15:15] Alarm ${y} - CLR${y} (w) */
    Ifx_UReg_32Bit CLR16:1;           /**< \brief [16:16] Alarm ${y} - CLR${y} (w) */
    Ifx_UReg_32Bit CLR17:1;           /**< \brief [17:17] Alarm ${y} - CLR${y} (w) */
    Ifx_UReg_32Bit CLR18:1;           /**< \brief [18:18] Alarm ${y} - CLR${y} (w) */
    Ifx_UReg_32Bit CLR19:1;           /**< \brief [19:19] Alarm ${y} - CLR${y} (w) */
    Ifx_UReg_32Bit CLR20:1;           /**< \brief [20:20] Alarm ${y} - CLR${y} (w) */
    Ifx_UReg_32Bit CLR21:1;           /**< \brief [21:21] Alarm ${y} - CLR${y} (w) */
    Ifx_UReg_32Bit CLR22:1;           /**< \brief [22:22] Alarm ${y} - CLR${y} (w) */
    Ifx_UReg_32Bit CLR23:1;           /**< \brief [23:23] Alarm ${y} - CLR${y} (w) */
    Ifx_UReg_32Bit CLR24:1;           /**< \brief [24:24] Alarm ${y} - CLR${y} (w) */
    Ifx_UReg_32Bit CLR25:1;           /**< \brief [25:25] Alarm ${y} - CLR${y} (w) */
    Ifx_UReg_32Bit CLR26:1;           /**< \brief [26:26] Alarm ${y} - CLR${y} (w) */
    Ifx_UReg_32Bit CLR27:1;           /**< \brief [27:27] Alarm ${y} - CLR${y} (w) */
    Ifx_UReg_32Bit CLR28:1;           /**< \brief [28:28] Alarm ${y} - CLR${y} (w) */
    Ifx_UReg_32Bit CLR29:1;           /**< \brief [29:29] Alarm ${y} - CLR${y} (w) */
    Ifx_UReg_32Bit CLR30:1;           /**< \brief [30:30] Alarm ${y} - CLR${y} (w) */
    Ifx_UReg_32Bit CLR31:1;           /**< \brief [31:31] Alarm ${y} - CLR${y} (w) */
} Ifx_EBCU_ALCLR_Bits;

/** \brief EBCU EDC Alarm Control Register */
typedef struct _Ifx_EBCU_ALCTRL_Bits
{
    Ifx_UReg_32Bit ALOV:1;            /**< \brief [0:0] Alarm Overflow - ALOV (rh) */
    Ifx_UReg_32Bit ALOVCLR:1;         /**< \brief [1:1] Alarm Overflow Clear - ALOVCLR (w) */
    Ifx_UReg_32Bit reserved_2:30;     /**< \brief [31:2] \internal Reserved */
} Ifx_EBCU_ALCTRL_Bits;

/** \brief SBCU EDC Alarm Status Register 0 */
typedef struct _Ifx_EBCU_ALSTAT_Bits
{
    Ifx_UReg_32Bit AL0:1;            /**< \brief [0:0] Alarm ${y} (w) */
    Ifx_UReg_32Bit AL1:1;            /**< \brief [1:1] Alarm ${y} (w) */
    Ifx_UReg_32Bit AL2:1;            /**< \brief [2:2] Alarm ${y} (w) */
    Ifx_UReg_32Bit AL3:1;            /**< \brief [3:3] Alarm ${y} (w) */
    Ifx_UReg_32Bit AL4:1;            /**< \brief [4:4] Alarm ${y} (w) */
    Ifx_UReg_32Bit AL5:1;            /**< \brief [5:5] Alarm ${y} (w) */
    Ifx_UReg_32Bit AL6:1;            /**< \brief [6:6] Alarm ${y} (w) */
    Ifx_UReg_32Bit AL7:1;            /**< \brief [7:7] Alarm ${y} (w) */
    Ifx_UReg_32Bit AL8:1;            /**< \brief [8:8] Alarm ${y} (w) */
    Ifx_UReg_32Bit AL9:1;            /**< \brief [9:9] Alarm ${y} (w) */
    Ifx_UReg_32Bit AL10:1;           /**< \brief [10:10] Alarm ${y} (w) */
    Ifx_UReg_32Bit AL11:1;           /**< \brief [11:11] Alarm ${y} (w) */
    Ifx_UReg_32Bit AL12:1;           /**< \brief [12:12] Alarm ${y} (w) */
    Ifx_UReg_32Bit AL13:1;           /**< \brief [13:13] Alarm ${y} (w) */
    Ifx_UReg_32Bit AL14:1;           /**< \brief [14:14] Alarm ${y} (w) */
    Ifx_UReg_32Bit AL15:1;           /**< \brief [15:15] Alarm ${y} (w) */
    Ifx_UReg_32Bit AL16:1;           /**< \brief [16:16] Alarm ${y} (w) */
    Ifx_UReg_32Bit AL17:1;           /**< \brief [17:17] Alarm ${y} (w) */
    Ifx_UReg_32Bit AL18:1;           /**< \brief [18:18] Alarm ${y} (w) */
    Ifx_UReg_32Bit AL19:1;           /**< \brief [19:19] Alarm ${y} (w) */
    Ifx_UReg_32Bit AL20:1;           /**< \brief [20:20] Alarm ${y} (w) */
    Ifx_UReg_32Bit AL21:1;           /**< \brief [21:21] Alarm ${y} (w) */
    Ifx_UReg_32Bit AL22:1;           /**< \brief [22:22] Alarm ${y} (w) */
    Ifx_UReg_32Bit AL23:1;           /**< \brief [23:23] Alarm ${y} (w) */
    Ifx_UReg_32Bit AL24:1;           /**< \brief [24:24] Alarm ${y} (w) */
    Ifx_UReg_32Bit AL25:1;           /**< \brief [25:25] Alarm ${y} (w) */
    Ifx_UReg_32Bit AL26:1;           /**< \brief [26:26] Alarm ${y} (w) */
    Ifx_UReg_32Bit AL27:1;           /**< \brief [27:27] Alarm ${y} (w) */
    Ifx_UReg_32Bit AL28:1;           /**< \brief [28:28] Alarm ${y} (w) */
    Ifx_UReg_32Bit AL29:1;           /**< \brief [29:29] Alarm ${y} (w) */
    Ifx_UReg_32Bit AL30:1;           /**< \brief [30:30] Alarm ${y} (w) */
    Ifx_UReg_32Bit AL31:1;           /**< \brief [31:31] Alarm ${y} (w) */
} Ifx_EBCU_ALSTAT_Bits;

/** \brief EBCU Control Register */
typedef struct _Ifx_EBCU_CON_Bits
{
    Ifx_UReg_32Bit TOUT:16;           /**< \brief [15:0] EBCU Bus Time-Out Value - TOUT (rw) */
    Ifx_UReg_32Bit DBG:1;             /**< \brief [16:16] EBCU Debug Trace Enable - DBG (rw) */
    Ifx_UReg_32Bit reserved_17:2;     /**< \brief [18:17] \internal Reserved */
    Ifx_UReg_32Bit ONE:1;             /**< \brief [19:19] \internal Reserved */
    Ifx_UReg_32Bit reserved_20:4;     /**< \brief [23:20] \internal Reserved */
    Ifx_UReg_32Bit SPC:8;             /**< \brief [31:24] Starvation Period Control - SPC (rw) */
} Ifx_EBCU_CON_Bits;

/** \brief EBCU Debug Address 1 Register */
typedef struct _Ifx_EBCU_DBADR1_Bits
{
    Ifx_UReg_32Bit ADR1:32;           /**< \brief [31:0] Debug Trigger Address 1 - ADR1 (rw) */
} Ifx_EBCU_DBADR1_Bits;

/** \brief EBCU Debug Address 2 Register */
typedef struct _Ifx_EBCU_DBADR2_Bits
{
    Ifx_UReg_32Bit ADR2:32;           /**< \brief [31:0] Debug Trigger Address 2 - ADR2 (rw) */
} Ifx_EBCU_DBADR2_Bits;

/** \brief EBCU Debug Trapped Address Register */
typedef struct _Ifx_EBCU_DBADRT_Bits
{
    Ifx_UReg_32Bit FPIADR:32;         /**< \brief [31:0] FPI Bus Address Status - FPIADR (rh) */
} Ifx_EBCU_DBADRT_Bits;

