Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEbcu_regdef.h
/** \brief EBCU Error Address Capture Register */
typedef struct _Ifx_EBCU_EADD_Bits
{
    Ifx_UReg_32Bit FPIADR:32;         /**< \brief [31:0] Captured FPI Bus Address - FPIADR (rwh) */
} Ifx_EBCU_EADD_Bits;

/** \brief EBCU Error Control Capture Register */
typedef struct _Ifx_EBCU_ECON_Bits
{
    Ifx_UReg_32Bit ERRCNT:14;         /**< \brief [13:0] FPI Bus Error Counter - ERRCNT (rwh) */
    Ifx_UReg_32Bit TOUT:1;            /**< \brief [14:14] State of FPI Bus Time-Out Signal - TOUT (rwh) */
    Ifx_UReg_32Bit RDY:1;             /**< \brief [15:15] State of FPI Bus Ready Signal - RDY (rwh) */
    Ifx_UReg_32Bit ABT:1;             /**< \brief [16:16] State of FPI Bus Abort Signal - ABT (rwh) */
    Ifx_UReg_32Bit ACK:2;             /**< \brief [18:17] State of FPI Bus Acknowledge Signals - ACK (rwh) */
    Ifx_UReg_32Bit SVM:1;             /**< \brief [19:19] State of FPI Bus Supervisor Mode Signal - SVM (rwh) */
    Ifx_UReg_32Bit WRN:1;             /**< \brief [20:20] State of FPI Bus Write Signal - WRN (rwh) */
    Ifx_UReg_32Bit RDN:1;             /**< \brief [21:21] State of FPI Bus Read Signal - RDN (rwh) */
    Ifx_UReg_32Bit TAG:6;             /**< \brief [27:22] FPI Bus Master Tag Number Signals - TAG (rwh) */
    Ifx_UReg_32Bit OPC:4;             /**< \brief [31:28] FPI Bus Operation Code Signals - OPC (rwh) */
} Ifx_EBCU_ECON_Bits;

/** \brief EBCU Error Data Capture Register */
typedef struct _Ifx_EBCU_EDAT_Bits
{
    Ifx_UReg_32Bit FPIDAT:32;         /**< \brief [31:0] Captured FPI Bus Data - FPIDAT (rwh) */
} Ifx_EBCU_EDAT_Bits;

/** \brief EBCU FPI Error Generation Control Register */
typedef struct _Ifx_EBCU_FEGEN_Bits
{
    Ifx_UReg_32Bit SEDM:3;            /**< \brief [2:0] SEDM (Slave Encoder) - SEDM (rw) */
    Ifx_UReg_32Bit reserved_3:5;      /**< \brief [7:3] \internal Reserved */
    Ifx_UReg_32Bit MEDM:3;            /**< \brief [10:8] MEDM (Master Encoder) Type of Error - MEDM (rw) */
    Ifx_UReg_32Bit reserved_11:5;     /**< \brief [15:11] \internal Reserved */
    Ifx_UReg_32Bit EN:3;              /**< \brief [18:16] Enable Signal Type of Error - EN (rw) */
    Ifx_UReg_32Bit reserved_19:5;     /**< \brief [23:19] \internal Reserved */
    Ifx_UReg_32Bit BCU:2;             /**< \brief [25:24] BCU Type of Error - BCU (rw) */
    Ifx_UReg_32Bit reserved_26:6;     /**< \brief [31:26] \internal Reserved */
} Ifx_EBCU_FEGEN_Bits;

/** \brief Module Identification Register */
typedef struct _Ifx_EBCU_ID_Bits
{
    Ifx_UReg_32Bit MOD_REV:8;         /**< \brief [7:0] Module Revision Number - MOD_REV (r) */
    Ifx_UReg_32Bit MOD_NUMBER:8;      /**< \brief [15:8] Module Number Value - MOD_NUMBER (r) */
    Ifx_UReg_32Bit reserved_16:16;    /**< \brief [31:16] \internal Reserved */
} Ifx_EBCU_ID_Bits;

/** \brief EBCU Arbiter Priority Register High */
typedef struct _Ifx_EBCU_PRIOH_Bits
{
    Ifx_UReg_32Bit RESERVED8:4;       /**< \brief [3:0] \internal Reserved */
    Ifx_UReg_32Bit RESERVED9:4;       /**< \brief [7:4] \internal Reserved */
    Ifx_UReg_32Bit RESERVED10:4;      /**< \brief [11:8] \internal Reserved */
    Ifx_UReg_32Bit RESERVED11:4;      /**< \brief [15:12] \internal Reserved */
    Ifx_UReg_32Bit RESERVED12:4;      /**< \brief [19:16] \internal Reserved */
    Ifx_UReg_32Bit RESERVED13:4;      /**< \brief [23:20] \internal Reserved */
    Ifx_UReg_32Bit RESERVED14:4;      /**< \brief [27:24] \internal Reserved */
    Ifx_UReg_32Bit RESERVED15:4;      /**< \brief [31:28] \internal Reserved */
} Ifx_EBCU_PRIOH_Bits;

/** \brief EBCU Arbiter Priority Register Low */
typedef struct _Ifx_EBCU_PRIOL_Bits
{
    Ifx_UReg_32Bit CIF:4;             /**< \brief [3:0] CIF FPI Bus Master Status - CIF (rwh) */
    Ifx_UReg_32Bit RESERVED1:4;       /**< \brief [7:4] \internal Reserved */
    Ifx_UReg_32Bit RESERVED2:4;       /**< \brief [11:8] \internal Reserved */
    Ifx_UReg_32Bit IOC32E:4;          /**< \brief [15:12] IOC32E Priority - IOC32E (rw) */
    Ifx_UReg_32Bit IOC32P:4;          /**< \brief [19:16] IOC32P Priority - IOC32P (rw) */
    Ifx_UReg_32Bit RESERVED5:4;       /**< \brief [23:20] \internal Reserved */
    Ifx_UReg_32Bit SFI_S2F:4;         /**< \brief [27:24] SFI Bridge SRI2FPI Priority - SFI_S2F (rw) */
    Ifx_UReg_32Bit RESERVED7:4;       /**< \brief [31:28] \internal Reserved */
} Ifx_EBCU_PRIOL_Bits;

/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_ebcu_union
 * \{   */
/** \brief Access Enable Register 0   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EBCU_ACCEN0_Bits B;           /**< \brief Bitfield access */
} Ifx_EBCU_ACCEN0;

/** \brief Access Enable Register 1   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EBCU_ACCEN1_Bits B;           /**< \brief Bitfield access */
} Ifx_EBCU_ACCEN1;

/** \brief EBCU EDC Alarm Clear Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EBCU_ALCLR_Bits B;            /**< \brief Bitfield access */
} Ifx_EBCU_ALCLR;

/** \brief EBCU EDC Alarm Control Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EBCU_ALCTRL_Bits B;           /**< \brief Bitfield access */
} Ifx_EBCU_ALCTRL;

/** \brief SBCU EDC Alarm Status Register 0   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EBCU_ALSTAT_Bits B;          /**< \brief Bitfield access */
} Ifx_EBCU_ALSTAT;

/** \brief EBCU Control Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EBCU_CON_Bits B;              /**< \brief Bitfield access */
} Ifx_EBCU_CON;

/** \brief EBCU Debug Address 1 Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EBCU_DBADR1_Bits B;           /**< \brief Bitfield access */
} Ifx_EBCU_DBADR1;

