Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEbcu_regdef.h
/** \brief EBCU Debug Address 2 Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EBCU_DBADR2_Bits B;           /**< \brief Bitfield access */
} Ifx_EBCU_DBADR2;

/** \brief EBCU Debug Trapped Address Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EBCU_DBADRT_Bits B;           /**< \brief Bitfield access */
} Ifx_EBCU_DBADRT;

/** \brief EBCU Debug Bus Operation Signals Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EBCU_DBBOS_Bits B;            /**< \brief Bitfield access */
} Ifx_EBCU_DBBOS;

/** \brief EBCU Debug Trapped Bus Operation Signals Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EBCU_DBBOST_Bits B;           /**< \brief Bitfield access */
} Ifx_EBCU_DBBOST;

/** \brief EBCU Debug Control Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EBCU_DBCNTL_Bits B;           /**< \brief Bitfield access */
} Ifx_EBCU_DBCNTL;

/** \brief EBCU Debug Data Status Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EBCU_DBDAT_Bits B;            /**< \brief Bitfield access */
} Ifx_EBCU_DBDAT;

/** \brief EBCU Debug Trapped Master Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EBCU_DBGNTT_Bits B;           /**< \brief Bitfield access */
} Ifx_EBCU_DBGNTT;

/** \brief EBCU Debug Grant Mask Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EBCU_DBGRNT_Bits B;           /**< \brief Bitfield access */
} Ifx_EBCU_DBGRNT;

/** \brief EBCU Error Address Capture Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EBCU_EADD_Bits B;             /**< \brief Bitfield access */
} Ifx_EBCU_EADD;

/** \brief EBCU Error Control Capture Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EBCU_ECON_Bits B;             /**< \brief Bitfield access */
} Ifx_EBCU_ECON;

/** \brief EBCU Error Data Capture Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EBCU_EDAT_Bits B;             /**< \brief Bitfield access */
} Ifx_EBCU_EDAT;

/** \brief EBCU FPI Error Generation Control Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EBCU_FEGEN_Bits B;            /**< \brief Bitfield access */
} Ifx_EBCU_FEGEN;

/** \brief Module Identification Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EBCU_ID_Bits B;               /**< \brief Bitfield access */
} Ifx_EBCU_ID;

/** \brief EBCU Arbiter Priority Register High   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EBCU_PRIOH_Bits B;            /**< \brief Bitfield access */
} Ifx_EBCU_PRIOH;

/** \brief EBCU Arbiter Priority Register Low   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EBCU_PRIOL_Bits B;            /**< \brief Bitfield access */
} Ifx_EBCU_PRIOL;

/** \}  */

/******************************************************************************/
/** \addtogroup IfxLld_Ebcu_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

/** \brief EBCU object */
typedef volatile struct _Ifx_EBCU
{
       Ifx_UReg_8Bit                       reserved_0[8];          /**< \brief 0, \internal Reserved */
       Ifx_EBCU_ID                         ID;                     /**< \brief 8, Module Identification Register*/
       Ifx_UReg_8Bit                       reserved_C[4];          /**< \brief C, \internal Reserved */
       Ifx_EBCU_CON                        CON;                    /**< \brief 10, EBCU Control Register*/
       Ifx_EBCU_PRIOH                      PRIOH;                  /**< \brief 14, EBCU Arbiter Priority Register High*/
       Ifx_EBCU_PRIOL                      PRIOL;                  /**< \brief 18, EBCU Arbiter Priority Register Low*/
       Ifx_UReg_8Bit                       reserved_1C[4];         /**< \brief 1C, \internal Reserved */
       Ifx_EBCU_ECON                       ECON;                   /**< \brief 20, EBCU Error Control Capture Register*/
       Ifx_EBCU_EADD                       EADD;                   /**< \brief 24, EBCU Error Address Capture Register*/
       Ifx_EBCU_EDAT                       EDAT;                   /**< \brief 28, EBCU Error Data Capture Register*/
       Ifx_UReg_8Bit                       reserved_2C[4];         /**< \brief 2C, \internal Reserved */
       Ifx_EBCU_DBCNTL                     DBCNTL;                 /**< \brief 30, EBCU Debug Control Register*/
       Ifx_EBCU_DBGRNT                     DBGRNT;                 /**< \brief 34, EBCU Debug Grant Mask Register*/
       Ifx_EBCU_DBADR1                     DBADR1;                 /**< \brief 38, EBCU Debug Address 1 Register*/
       Ifx_EBCU_DBADR2                     DBADR2;                 /**< \brief 3C, EBCU Debug Address 2 Register*/
       Ifx_EBCU_DBBOS                      DBBOS;                  /**< \brief 40, EBCU Debug Bus Operation Signals Register*/
       Ifx_EBCU_DBGNTT                     DBGNTT;                 /**< \brief 44, EBCU Debug Trapped Master Register*/
       Ifx_EBCU_DBADRT                     DBADRT;                 /**< \brief 48, EBCU Debug Trapped Address Register*/
       Ifx_EBCU_DBBOST                     DBBOST;                 /**< \brief 4C, EBCU Debug Trapped Bus Operation Signals Register*/
       Ifx_EBCU_DBDAT                      DBDAT;                  /**< \brief 50, EBCU Debug Data Status Register*/
       Ifx_UReg_8Bit                       reserved_54[12];        /**< \brief 54, \internal Reserved */
       Ifx_EBCU_ALSTAT                    ALSTAT[4];               /**< \brief 60, SBCU EDC Alarm Status Register */
       Ifx_EBCU_ALCLR                      ALCLR[4];               /**< \brief 70, EBCU EDC Alarm Clear Register ${x}*/
       Ifx_EBCU_ALCTRL                     ALCTRL;                 /**< \brief 80, EBCU EDC Alarm Control Register*/
       Ifx_EBCU_FEGEN                      FEGEN;                  /**< \brief 84, EBCU FPI Error Generation Control Register*/
       Ifx_UReg_8Bit                       reserved_88[112];       /**< \brief 88, \internal Reserved */
       Ifx_EBCU_ACCEN1                     ACCEN1;                 /**< \brief F8, Access Enable Register 1*/
       Ifx_EBCU_ACCEN0                     ACCEN0;                 /**< \brief FC, Access Enable Register 0*/
} Ifx_EBCU;

/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXEBCU_REGDEF_H */
